Services/src/Documents/РегистрацияИТС/РегистрацияИТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияИТС</name>
  <registerRecords>AccumulationRegister.РегистрацияИТСОбороты</registerRecords>
  <registerRecords>InformationRegister.С_РегистрацияИТС</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИТС</name>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Services/src/Documents/РегистрацияИТС/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	
	ПрочитатьФайлы(Объект.ПутьКФайлу);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр                      = НСтр("ru = 'Файл'") + " (*.xlsx)|*.xlsx";
	ДиалогВыбора.Заголовок                   = НСтр("ru = 'Выберите файл данных'");
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.Расширение                  = "xlsx";
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбора.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры



Процедура ПрочитатьФайлы(ИмяВременногоФайла)
	
	ТаблицаИТС = Новый ТаблицаЗначений;
	ТаблицаИТС.Колонки.Добавить("РегистрационныйНомер", Новый ОписаниеТипов("Строка"));
	ТаблицаИТС.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("Строка"));
	ТаблицаИТС.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	ТаблицаИТС.Колонки.Добавить("Инн10", Новый ОписаниеТипов("Строка"));
	ТаблицаИТС.Колонки.Добавить("ДатаС", Новый ОписаниеТипов("Дата"));
	ТаблицаИТС.Колонки.Добавить("ДатаПо", Новый ОписаниеТипов("Дата"));
	
	ТаблицаИТСД = Новый ТаблицаЗначений;
	ТаблицаИТСД.Колонки.Добавить("РегистрационныйНомер", Новый ОписаниеТипов("Строка"));
	ТаблицаИТСД.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("Строка"));
	ТаблицаИТСД.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	ТаблицаИТСД.Колонки.Добавить("Инн10", Новый ОписаниеТипов("Строка"));
	ТаблицаИТСД.Колонки.Добавить("ДатаС", Новый ОписаниеТипов("Дата"));
	ТаблицаИТСД.Колонки.Добавить("ДатаПо", Новый ОписаниеТипов("Дата"));


		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);    
	
	КолвоСтрокФайла = ТабличныйДокумент.ВысотаТаблицы;
	КонечнаяКолонка = ТабличныйДокумент.ПолучитьОбласть().ШиринаТаблицы;
	
	Если КолвоСтрокФайла = 0 Тогда
		ТабличныйДокумент = Неопределено;
	КонецЕсли;
	
		
	ТекстПартнер = Ложь;
	ТекстПартнер = ТабличныйДокумент.ПолучитьОбласть("R4C1").ТекущаяОбласть.Текст = "Партнер";
	
	Если  ТекстПартнер Тогда
		
		Для счCтр =  5 по КолвоСтрокФайла Цикл
			
			счСтр = СоКрЛП(СтрЗаменить(счCтр, Символы.НПП, ""));
			
			РегНомер =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C3").ТекущаяОбласть.Текст);
			Пользователь =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C4").ТекущаяОбласть.Текст);
			ИНН =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C5").ТекущаяОбласть.Текст);     
			Инн10 = "";
			Если СтрДлина(ИНН) >9 И Лев(ИНН,1)  = "0" Тогда
				Инн10 = ИНН;
				ДлинаИНН = СтрДлина(ИНН)-1;
				ИНН = Прав(Инн, ДлинаИНН);
			КонецЕсли;
			
			ДатаНачалаТекст =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C7").ТекущаяОбласть.Текст);
			
			ДатаОкончанияТекст =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C8").ТекущаяОбласть.Текст);
			
			ДатаС = Дата(Прав(ДатаНачалаТекст, 4)+ Сред(ДатаНачалаТекст,4,2) + Лев(ДатаНачалаТекст, 2)); 
			
			ДатаПо = Дата(Прав(ДатаОкончанияТекст, 4)+ Сред(ДатаОкончанияТекст,4,2) + Лев(ДатаОкончанияТекст, 2)); 
			
			Дополнительно =    СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C22").ТекущаяОбласть.Текст);
			МассивРегНомеров = Новый Массив;
			Если Дополнительно <> "" Тогда
				
				КоличествоСтрок =  СтрЧислоВхождений(Дополнительно, ";");
				ДополнительноСтр = СтрЗаменить(Дополнительно, ";", Символы.ВК);
				
				Для сч = 1 по КоличествоСтрок+1  Цикл
					МассивРегНомеров.Добавить(СтрПолучитьСтроку(ДополнительноСтр,сч));			
				КонецЦикла;
				
			КонецЕсли;
			
			
			НоваяСтрока =  ТаблицаИТС.Добавить();
			НоваяСтрока.РегистрационныйНомер =  РегНомер;
			НоваяСтрока.Пользователь =  Пользователь;
			НоваяСтрока.ИНН =  СтрЗаменить(СокрЛП(ИНН), Символы.НПП, "");
			НоваяСтрока.Инн10 =  СтрЗаменить(СокрЛП(Инн10), Символы.НПП, "");
			НоваяСтрока.ДатаС =  ДатаС;
			НоваяСтрока.ДатаПо =  ДатаПо;
			
			Если МассивРегНомеров.Количество() > 0 Тогда
				
				Для каждого текСт Из МассивРегНомеров Цикл
					НоваяСтрока =  ТаблицаИТСД.Добавить();
					НоваяСтрока.РегистрационныйНомер =  текСт;
					НоваяСтрока.Пользователь =  Пользователь;
					НоваяСтрока.ИНН =  СтрЗаменить(СокрЛП(ИНН), Символы.НПП, "");
					НоваяСтрока.Инн10 =  СтрЗаменить(СокрЛП(Инн10), Символы.НПП, "");
					НоваяСтрока.ДатаС =  ДатаС;
					НоваяСтрока.ДатаПо =  ДатаПо;
				КонецЦикла; 
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		
		Для каждого текСтрока  Из ТаблицаИТСД  Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИНН",СтрЗаменить(СокрЛП(текСтрока.ИНН), Символы.НПП, ""));
			Отбор.Вставить("РегистрационныйНомер",текСтрока.РегистрационныйНомер);
			
			МассивСтрок = ТаблицаИТС.НайтиСтроки(Отбор);
			
			Если МассивСТрок.Количество() = 0 Тогда
				СтрокаТИТС = ТаблицаИТС.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТИТС, текСтрока);
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Для каждого тексСтр из  ТаблицаИТС Цикл
		тексСтр.ИНН = СтрЗАменить(СтрЗАменить(тексСтр.Инн, Символы.НПП, ""), " ", "");
		тексСтр.РегистрационныйНомер = СтрЗАменить(СтрЗаменить(тексСтр.РегистрационныйНомер, Символы.НПП,""), " ", "");
	КонецЦикла;

	
	Объект.ИТС.Очистить();
	Объект.ИТС.Загрузить(ТаблицаИТС);
	
КонецПроцедуры	

Процедура ЧтениеФайла(ИмяВременногоФайла)
	//Попытка
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//МассивНовыйФайл = НайтиФайлы("D:\ITS", "*NewSub*");
	МассивНовыйФайл = НайтиФайлы(ИмяВременногоФайла);
	Если МассивНовыйФайл.Количество()> 0 Тогда
		НовыйФайл =  МассивНовыйФайл[0];
		
		ТабличныйДокумент.Прочитать(НовыйФайл.ПолноеИмя, СпособЧтенияЗначенийТабличногоДокумента.Значение);    
		
		КолвоСтрокФайла = ТабличныйДокумент.ВысотаТаблицы;
		КонечнаяКолонка = ТабличныйДокумент.ПолучитьОбласть().ШиринаТаблицы;
		
		Если КолвоСтрокФайла = 0 Тогда
			ТабличныйДокумент = Неопределено;
		КонецЕсли;
		
		ТаблицаИТС = Новый ТаблицаЗначений;
		ТаблицаИТС.Колонки.Добавить("РегистрационныйНомер", Новый ОписаниеТипов("Строка"));
		ТаблицаИТС.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("Строка"));
		ТаблицаИТС.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
		ТаблицаИТС.Колонки.Добавить("Инн10", Новый ОписаниеТипов("Строка"));
		ТаблицаИТС.Колонки.Добавить("ДатаС", Новый ОписаниеТипов("Дата"));
		ТаблицаИТС.Колонки.Добавить("ДатаПо", Новый ОписаниеТипов("Строка"));
		
		ТаблицаИТСД = Новый ТаблицаЗначений;
		ТаблицаИТСД.Колонки.Добавить("РегистрационныйНомер", Новый ОписаниеТипов("Строка"));
		ТаблицаИТСД.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("Строка"));
		ТаблицаИТСД.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
		ТаблицаИТСД.Колонки.Добавить("Инн10", Новый ОписаниеТипов("Строка"));
		ТаблицаИТСД.Колонки.Добавить("ДатаС", Новый ОписаниеТипов("Дата"));
		ТаблицаИТСД.Колонки.Добавить("ДатаПо", Новый ОписаниеТипов("Строка"));

		ТекстПартнер = Ложь;
		ТекстПартнер = ТабличныйДокумент.ПолучитьОбласть("R4C1").ТекущаяОбласть.Текст = "Партнер";
		
		Если  ТекстПартнер Тогда
			
			Для счCтр =  5 по КолвоСтрокФайла Цикл
				счСтр = СоКрЛП(СтрЗаменить(счCтр, Символы.НПП, ""));
				
				РегНомер =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C3").ТекущаяОбласть.Текст);
				Пользователь =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C4").ТекущаяОбласть.Текст);
				ИНН =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C5").ТекущаяОбласть.Текст);     
				Инн10 = "";
				Если СтрДлина(ИНН) >9 И Лев(ИНН,1)  = "0" Тогда
					Инн10 = ИНН;
					ДлинаИНН = СтрДлина(ИНН)-1;
					ИНН = Прав(Инн, ДлинаИНН);
				КонецЕсли;
				
				ДатаНачалаТекст =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C7").ТекущаяОбласть.Текст);
				ДатаОкончанияТекст =  СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C8").ТекущаяОбласть.Текст);
				
				ДатаНачала = Дата(Прав(ДатаНачалаТекст, 4)+ Сред(ДатаНачалаТекст,4,2) + Лев(ДатаНачалаТекст, 2)); 
				ДатаОкончания = Дата(Прав(ДатаОкончанияТекст, 4)+ Сред(ДатаОкончанияТекст,4,2) + Лев(ДатаОкончанияТекст, 2)); 
				
				Дополнительно =    СокрЛП(ТабличныйДокумент.ПолучитьОбласть("R" + счСтр + "C22").ТекущаяОбласть.Текст);
				МассивРегНомеров = Новый Массив;
				Если Дополнительно <> "" Тогда
					КоличествоСтрок =  СтрЧислоВхождений(Дополнительно, ";");
					ДополнительноСтр = СтрЗаменить(Дополнительно, ";", Символы.ВК);
					
					Для сч = 1 по КоличествоСтрок+1  Цикл
						МассивРегНомеров.Добавить(СтрПолучитьСтроку(ДополнительноСтр,сч));			
					КонецЦикла;
					
				КонецЕсли;
				
				
				НоваяСтрока =  ТаблицаИТС.Добавить();
				НоваяСтрока.РегистрационныйНомер =  РегНомер;
				НоваяСтрока.Пользователь =  Пользователь;
				НоваяСтрока.ИНН =  ИНН;
				НоваяСтрока.Инн10 =  Инн10;
				НоваяСтрока.ДатаС =  ДатаНачала;
				НоваяСтрока.ДатаПо =  ДатаОкончания;
				
				Если МассивРегНомеров.Количество() > 0 Тогда
					
					Для каждого текСт Из МассивРегНомеров Цикл
						НоваяСтрока =  ТаблицаИТСД.Добавить();
						НоваяСтрока.РегистрационныйНомер =  текСт;
						НоваяСтрока.Пользователь =  Пользователь;
						НоваяСтрока.ИНН =  ИНН;
						НоваяСтрока.Инн10 =  Инн10;
						НоваяСтрока.ДатаС =  ДатаНачала;
						НоваяСтрока.ДатаПо =  ДатаОкончания;
					КонецЦикла; 
					
				КонецЕсли;	
				
			КонецЦикла;	
			
			
			Для каждого текСтрока  Из ТаблицаИТСД  Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН",текСтрока.ИНН);
				Отбор.Вставить("РегистрационныйНомер",текСтрока.РегистрационныйНомер);
				
				МассивСтрок = ТаблицаИТС.НайтиСтроки(Отбор);
				
				Если МассивСТрок.Количество() =0 Тогда
					СтрокаТИТС = ТаблицаИТС.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТИТС, текСтрока);
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
		
	
	КонецЕсли;	
	

КонецПроцедуры
